src/test/resources/testData/ivmessagetemplate260.xml

<?xml version="1.0" encoding="UTF-8"?>

<ns0:Envelope xmlns:ns0="http://www.w3.org/2003/05/soap-envelope">
    <ns0:Header>
        <ns1:ServiceConsumerData xmlns:ns1="http://uscis.gov/uscis/xsd/esb2/serviceauditingframework/2.0">
            <ns1:ServiceRequestTimestamp>2014-12-22T15:10:00.016-05:00</ns1:ServiceRequestTimestamp>
            <ns1:SourceSystem>TSS-DataShare</ns1:SourceSystem>
            <ns1:AuditCorrelationID>8a724017-6b8e-4240-86f1-2b026957e287</ns1:AuditCorrelationID>
            <ns1:EndUserID>USCIS-IOESS-USER</ns1:EndUserID>
            <ns1:AuthenticationID>USCIS-IOESS-USER</ns1:AuthenticationID>
        </ns1:ServiceConsumerData>
    </ns0:Header>
    <ns0:Body>
        <ns1:CaseStatusUpdate xmlns:ns1="http://uscis.gov/uscis/xsd/esb/csu/exchange/1.0">
            <ns2:ActivityIdentification xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:IdentificationID>DHK900989000</ns2:IdentificationID>
                <ns2:IdentificationCategoryDescriptionText>IVIS_CASE_NUMBER</ns2:IdentificationCategoryDescriptionText>
            </ns2:ActivityIdentification>
            <ns2:ActivityIdentification xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:IdentificationID>79</ns2:IdentificationID>
                <ns2:IdentificationCategoryDescriptionText>POST_SEQ_NUMBER</ns2:IdentificationCategoryDescriptionText>
            </ns2:ActivityIdentification>
            <ns2:ActivityIdentification xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:IdentificationID>04</ns2:IdentificationID>
                <ns2:IdentificationCategoryDescriptionText>Receipt Sequence Number</ns2:IdentificationCategoryDescriptionText>
            </ns2:ActivityIdentification>
            <ns2:ActivityIdentification xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:IdentificationID>IDHK9009890079</ns2:IdentificationID>
                <ns2:IdentificationCategoryDescriptionText>IVACS CASE NUMBER</ns2:IdentificationCategoryDescriptionText>
            </ns2:ActivityIdentification>
            <ns2:ActivityIdentification xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:IdentificationID/>
                <ns2:IdentificationCategoryDescriptionText>Receipt Number</ns2:IdentificationCategoryDescriptionText>
            </ns2:ActivityIdentification>
            <ns2:ActivityIdentification xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:IdentificationID>DHK9009890079</ns2:IdentificationID>
                <ns2:IdentificationCategoryDescriptionText>DOS CASE ID</ns2:IdentificationCategoryDescriptionText>
            </ns2:ActivityIdentification>
            <ns2:ActivityDateRange xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:StartDate>
                    <ns2:Date>2014-06-09</ns2:Date>
                </ns2:StartDate>
            </ns2:ActivityDateRange>
            <ns2:ActivityStatus xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:StatusText>A</ns2:StatusText>
                <ns2:StatusDate>
                    <ns2:DateTime>2014-06-09T09:48:52</ns2:DateTime>
                </ns2:StatusDate>
                <ns2:StatusDescriptionText>Approved</ns2:StatusDescriptionText>
                <ns2:StatusIssuerText>DoS</ns2:StatusIssuerText>
            </ns2:ActivityStatus>
            <ns2:ActivityStatus xmlns:ns2="http://niem.gov/niem/niem-core/2.0">
                <ns2:StatusText>DETAILED</ns2:StatusText>
                <ns2:StatusDescriptionText>IOE Case Status Update Type</ns2:StatusDescriptionText>
            </ns2:ActivityStatus>
            <ns2:Person xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:id="APPLICANT">
                <ns4:PersonBirthDate xmlns:ns4="http://niem.gov/niem/niem-core/2.0">
                    <ns4:Date>1982-04-10</ns4:Date>
                </ns4:PersonBirthDate>
                <ns4:PersonMaritalStatusText xmlns:ns4="http://niem.gov/niem/niem-core/2.0">M</ns4:PersonMaritalStatusText>
                <ns2:PersonName xmlns:ns4="http://niem.gov/niem/niem-core/2.0" ns4:personNameCommentText="LEGAL_NAME">
                    <ns4:PersonGivenName>ZJUPUU</ns4:PersonGivenName>
                    <ns4:PersonMiddleName/>
                    <ns4:PersonSurName>BUGUM</ns4:PersonSurName>
                </ns2:PersonName>
                <ns2:PersonName xmlns:ns4="http://niem.gov/niem/niem-core/2.0" ns4:personNameCommentText="ALIAS1_NAME">
                    <ns4:PersonGivenName/>
                    <ns4:PersonMiddleName/>
                    <ns4:PersonSurName/>
                </ns2:PersonName>
                <ns2:PersonName xmlns:ns4="http://niem.gov/niem/niem-core/2.0" ns4:personNameCommentText="ALIAS2_NAME">
                    <ns4:PersonGivenName/>
                    <ns4:PersonMiddleName/>
                    <ns4:PersonSurName/>
                </ns2:PersonName>
                <ns4:PersonSexText xmlns:ns4="http://niem.gov/niem/niem-core/2.0">F</ns4:PersonSexText>
                <ns4:PersonBirthLocation xmlns:ns4="http://niem.gov/niem/niem-core/2.0">
                    <ns4:LocationAddress>
                        <ns4:StructuredAddress>
                            <ns4:LocationCityName>MOULVIBAZAR</ns4:LocationCityName>
                            <ns4:LocationCountyName>BGD</ns4:LocationCountyName>
                        </ns4:StructuredAddress>
                    </ns4:LocationAddress>
                </ns4:PersonBirthLocation>
                <ns2:PersonLimitedPeopleFromReligion/>
            </ns2:Person>
            <ns2:Person xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:id="FATHER">
                <ns2:PersonName>
                    <ns4:PersonGivenName xmlns:ns4="http://niem.gov/niem/niem-core/2.0">UBDUL</ns4:PersonGivenName>
                    <ns4:PersonSurName xmlns:ns4="http://niem.gov/niem/niem-core/2.0">KJULIQUU</ns4:PersonSurName>
                </ns2:PersonName>
            </ns2:Person>
            <ns2:Person xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:id="MOTHER">
                <ns2:PersonName>
                    <ns4:PersonGivenName xmlns:ns4="http://niem.gov/niem/niem-core/2.0">RUBY</ns4:PersonGivenName>
                    <ns4:PersonSurName xmlns:ns4="http://niem.gov/niem/niem-core/2.0">BUGUM</ns4:PersonSurName>
                </ns2:PersonName>
            </ns2:Person>
            <ns2:PersonCountryAssociation xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1">
                <ns2:AlienRole>
                    <ns2:RoleOfPartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="APPLICANT"/>
                    <ns3:AlienIDDetails xmlns:ns3="http://niem.gov/niem/domains/immigration/2.0">
                        <ns3:AlienNumber>
                            <ns4:IdentificationID xmlns:ns4="http://niem.gov/niem/niem-core/2.0">066897979</ns4:IdentificationID>
                        </ns3:AlienNumber>
                    </ns3:AlienIDDetails>
                    <ns2:AlienCitizenship>
                        <ns2:CitizenshipLocation>
                            <ns3:StructuredAddress xmlns:ns3="http://niem.gov/niem/niem-core/2.0">
                                <ns3:LocationCountryName>BGD</ns3:LocationCountryName>
                            </ns3:StructuredAddress>
                        </ns2:CitizenshipLocation>
                    </ns2:AlienCitizenship>
                    <ns2:AlienImmigrationStatus>
                        <ns3:ImmigrationStatusCode xmlns:ns3="http://niem.gov/niem/domains/immigration/2.0">F42</ns3:ImmigrationStatusCode>
                    </ns2:AlienImmigrationStatus>
                    <ns3:AdmissionIdentification xmlns:ns3="http://niem.gov/niem/domains/immigration/2.0">
                        <ns4:IdentificationCategoryDescriptionText xmlns:ns4="http://niem.gov/niem/niem-core/2.0"> </ns4:IdentificationCategoryDescriptionText>
                        <ns4:IdentificationEffectiveDate xmlns:ns4="http://niem.gov/niem/niem-core/2.0"/>
                        <ns4:IdentificationJurisdictionText xmlns:ns4="http://niem.gov/niem/niem-core/2.0"/>
                    </ns3:AdmissionIdentification>
                </ns2:AlienRole>
                <ns3:LocationCountryName xmlns:ns3="http://niem.gov/niem/niem-core/2.0"/>
                <ns2:CountryOfChargeability>BGD</ns2:CountryOfChargeability>
            </ns2:PersonCountryAssociation>
            <ns2:PartyContactAddressAssociation xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" type="RESIDENCE">
                <ns2:PartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="APPLICANT"/>
                <ns2:ContactAddress>
                    <ns3:LocationAddress xmlns:ns3="http://niem.gov/niem/niem-core/2.0">
                        <ns3:StructuredAddress>
                            <ns3:LocationCityName/>
                            <ns3:LocationCountyName>BGD</ns3:LocationCountyName>
                        </ns3:StructuredAddress>
                    </ns3:LocationAddress>
                </ns2:ContactAddress>
            </ns2:PartyContactAddressAssociation>
            <ns2:PartyContactAddressAssociation xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" type="PHYSICAL">
                <ns2:PartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="APPLICANT"/>
                <ns2:ContactAddress>
                    <ns3:LocationAddress xmlns:ns3="http://niem.gov/niem/niem-core/2.0">
                        <ns3:StructuredAddress>
                            <ns3:AddressRecipientName>BUKZJ, RUMU</ns3:AddressRecipientName>
                            <ns3:LocationStreet>
                                <ns3:StreetFullText>456 MAIN</ns3:StreetFullText>
                            </ns3:LocationStreet>
                            <ns3:LocationCityName>NEW YORK</ns3:LocationCityName>
                            <ns3:LocationStateName>NY</ns3:LocationStateName>
                            <ns3:LocationPostalCode>10029</ns3:LocationPostalCode>
                        </ns3:StructuredAddress>
                    </ns3:LocationAddress>
                </ns2:ContactAddress>
            </ns2:PartyContactAddressAssociation>
            <ns2:PartyContactTelephoneAssociation xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1">
                <ns2:PartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="APPLICANT"/>
                <ns2:ContactTelephoneNumber>
                    <ns2:TelephoneNumber>
                        <ns3:FullTelephoneNumber xmlns:ns3="http://niem.gov/niem/niem-core/2.0">
                            <ns3:TelephoneNumberFullID>9998765507</ns3:TelephoneNumberFullID>
                        </ns3:FullTelephoneNumber>
                    </ns2:TelephoneNumber>
                </ns2:ContactTelephoneNumber>
            </ns2:PartyContactTelephoneAssociation>
            <ns2:PersonEmploymentAssociation xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:id="APPLICANT_EMPLOYMENT" party_employer_type="EMPLOYER">
                <ns2:GenericEmployeeRole>
                    <ns2:RoleOfPartyReference ns3:ref="APPLICANT"/>
                    <ns4:EmployeeOccupationText xmlns:ns4="http://niem.gov/niem/niem-core/2.0">HOU</ns4:EmployeeOccupationText>
                    <ns2:LaborCertificationCode>N</ns2:LaborCertificationCode>
                </ns2:GenericEmployeeRole>
            </ns2:PersonEmploymentAssociation>
            <ns2:PersonBenefitRole xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" type="APPLICANT">
                <ns2:RoleOfPartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="APPLICANT"/>
            </ns2:PersonBenefitRole>
            <ns2:ImmigrationBenefitTypeIVandAlienRegistration xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1" type="Immigrant VISA and Alien Registration">
                <ns3:ActivityCategoryText xmlns:ns3="http://niem.gov/niem/niem-core/2.0">DS-260</ns3:ActivityCategoryText>
            </ns2:ImmigrationBenefitTypeIVandAlienRegistration>
            <ns2:CardDocument xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1">
                <ns2:DocumentStatus>
                    <ns3:StatusIssuerIdentification xmlns:ns3="http://niem.gov/niem/niem-core/2.0">
                        <ns3:IdentificationEffectiveDate>
                            <ns3:DateTime>2014-06-09T09:48:52</ns3:DateTime>
                        </ns3:IdentificationEffectiveDate>
                        <ns3:IdentificationExpirationDate>
                            <ns3:Date>2014-11-17</ns3:Date>
                        </ns3:IdentificationExpirationDate>
                    </ns3:StatusIssuerIdentification>
                    <ns3:StatusIssuerText xmlns:ns3="http://niem.gov/niem/niem-core/2.0">DHK</ns3:StatusIssuerText>
                </ns2:DocumentStatus>
                <ns3:AddressRecipientName xmlns:ns3="http://niem.gov/niem/niem-core/2.0"/>
            </ns2:CardDocument>
            <ns2:ParentChildAssociation xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1">
                <ns2:ParentRole>
                    <ns2:RoleOfPartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="FATHER"/>
                    <ns2:ParentCode>FATHER</ns2:ParentCode>
                </ns2:ParentRole>
                <ns2:OffspringRole>
                    <ns2:RoleOfPartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="APPLICANT"/>
                </ns2:OffspringRole>
            </ns2:ParentChildAssociation>
            <ns2:ParentChildAssociation xmlns:ns2="http://uscis.gov/uscis/xsd/services/lockbox/cdm/1.1">
                <ns2:ParentRole>
                    <ns2:RoleOfPartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="MOTHER"/>
                    <ns2:ParentCode>MOTHER</ns2:ParentCode>
                </ns2:ParentRole>
                <ns2:OffspringRole>
                    <ns2:RoleOfPartyReference xmlns:ns3="http://niem.gov/niem/structures/2.0" ns3:ref="APPLICANT"/>
                </ns2:OffspringRole>
            </ns2:ParentChildAssociation>
        </ns1:CaseStatusUpdate>
    </ns0:Body>
</ns0:Envelope>